---
kind: property
id: P:Autodesk.Revit.DB.BaseArray.NumMembers
source: html/66183f2d-7dee-631d-3dcb-0d484d134c91.htm
---
# Autodesk.Revit.DB.BaseArray.NumMembers Property

Retrieves or changes the number of the arrayed members.

## Syntax (C#)
```csharp
public abstract int NumMembers { get; set; }
```